In [50]:
import pandas as pd

# create a sample dataframe
df = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
}, index=[5, 4, 3, 2, 1])

df

   A
5  1
4  2
3  3
2  4
1  5

In [51]:
df.reset_index()

   index  A
0      5  1
1      4  2
2      3  3
3      2  4
4      1  5

In [34]:
df

   A
5  1
4  2
3  3
2  4
1  5

In [42]:
df.reset_index(inplace = False)

   level_0  index  A
0        0      5  1
1        1      4  2
2        2      3  3
3        3      2  4
4        4      1  5

In [43]:
df

   index  A
0      5  1
1      4  2
2      3  3
3      2  4
4      1  5

In [44]:
df

   index  A
0      5  1
1      4  2
2      3  3
3      2  4
4      1  5

In [45]:
df.reset_index(drop = True)

   index  A
0      5  1
1      4  2
2      3  3
3      2  4
4      1  5

In [46]:
df

   index  A
0      5  1
1      4  2
2      3  3
3      2  4
4      1  5

In [47]:
df

   index  A
0      5  1
1      4  2
2      3  3
3      2  4
4      1  5

In [48]:
df

   index  A
0      5  1
1      4  2
2      3  3
3      2  4
4      1  5